class GuideMent {
  final String title;
  final List<String> content;
  GuideMent({
    required this.title,
    required this.content,
  });
}

List<GuideMent> guideMent = [
  GuideMent(title: "아이 강점", content: [
    "(눈맞춤 우세)놀이 상대자인 엄마를 바라보고 계속 눈을 맞추면서 자신이 하고 있는 활동을 보여주거나 관심을 공유하고자 하는 모습이 자주 관찰되었어요. 심지어 부모가 아이를 보고있지 못하는 상황에서도 아이는 부모를 바라보기도 했답니다. 이렇게 자신의 것을 공유하며 놀이에 상대를 불러들이는 행동은 사회성에 기본이 되는 중요한 자원이에요.  이러한 강점을 살려 10분의 놀이와 일상생활에서 되도록 함께 눈을 맞추어 주도록 노력한다면 더욱 좋아요.",
    "아이는 잘 안되거나 실패하는 순간에도 여러차례 같은 시도를 반복하는 모습을 보여주고 있어요. 실제 성공여부와 상관없이 반복하는 시도 자체가 인지발달에 있어 매우 중요한 요인이에요. 반복해야지만 배울 수 있기 때문이죠. 아이의 반복능력을 강점으로 인식하고 격려해주세요:)",
    "아이는 놀이 시간 내내 에너지가높아 보였고 놀이를 충분히 즐거워 하고 있는 것이 느껴졌어요. 아이의 목소리와 표정도 흥분되어 있을 뿐만 아니라, 충분히 놀이 안에서 주도하고 표현하고 있었어요. 즐겁게 놀이를 할 수 있으면, 아이가 일상에서 느낀 스트레스를 해소할 수 있고, 같은 10분이지만 부모와 보내는 시간에도 더욱 만족하게 되기에 매우 좋은 강점이에요.",
    "아이는 자신의 놀이를 스스로 시작하고 이끌고 나가는 모습이 자주 관찰되었어요. 놀이 안에 자신의 이야기를 표현하고 적극적으로 즐기는 모습도 보였어요. 놀이를 즐기고 주도하는 힘은 이 시기 아이들에게 가장 중요한 자원 중 하나랍니다. 자신이 주도하는 놀이가 있어야 일상생활에서 해결하지 못한 긴장감도 해소하고, 스스로에 대한 내적인 힘을 키워갈 수 있기 때문이에요. 지금처럼 놀이에서 만큼은 주인이 될 수 있도록 격려해주세요.",
    "아이는 10분의 놀이 시간동안 자신이 흥미롭게 여기는 1-2개의 활동에 집중하여 머무는 모습이 관찰되었어요. 놀이 활동 한 두가지에 머물 수 있게 되면 놀이 자체가 더욱 깊고 풍성하게 확장될 가능성 또한 높아지기에 아이의 전체적인 발달에 아주 긍정적인 영향을 미치는 강점이에요. 아이가 무언가에 몰두한다면 좋은 강점으로 여겨주시고 그것을 끊어버리지 않도록 존중해주시는 것도 필요해요 ",
  ]),
  GuideMent(
    title: "아이 보완점",
    content: [
      "아이는 자신의 관심과 놀이를 엄마에게 공유하기 보다는 자신이 하는 활동에 주로 몰두하는 모습을 보여주었어요. 눈맞춤을 하거나 자신의 놀이에 엄마를 적극적으로 초대하는 모습은 상대적으로 많이 관찰되지 않았답니다.   하지만 자신의 것에 몰두하는 것은 장점이 될 수도 있으며, 아이의 관심에 대한 반응과 적극적인 눈맞춤을 통해 보완해나갈 수 있어요.",
      "아이는 의도대로 잘 되지 않을 때 한번 더 반복하기 보다는 포기하고 다른 활동으로 옮겨가는 장면을 더 많이 보여주었어요. 반복하는 것만 좋은 것은 아니지만, 한번 이라도 더 반복할 수 있는 기회가 주어지는 것은 아이의 인지발달 및 문제해결능력에 도움이 될 수 있어요. 억지로 강요하기 보다는, 조금씩 아이가 한번이라도 더 시도할 수 있게 지지해주시는 것이 필요해요",
      "아이는 일반적인 보통의 정서상태를 보여줄 뿐 놀이안에 자신의 이야기를 담으며 신나거나 흥분한 모습을 발견하기가 다소 어려웠어요. 놀이는 아이에게 있어 심리적인 스트레스를 해소하고 자신을 표현하는 기능을 하다보니, 놀이가 즐겁지 않은 경우 일상생활에서 갑작스러운 짜증이 많아질 수 있어요. 아이가 보다 주도적으로 즐겁고 자유롭게 놀이할 수 있도록 상호작용을 배우신다면 도움이 될 수 있어요.",
      "아이가 스스로의 놀이를 시작하고 이끌고 나갈 수 있도록 지지해줄 필요가 있어요",
      "아이가 흥미로워하는 활동을 통해 한 두가지에 몰입하여 깊이 있게 놀이하도록 도와줄 필요가 있어요"
    ],
  ),
  GuideMent(
    title: "부모 강점",
    content: [
      "놀이장면 내내 아이와 되도록 마주보고 눈을 맞추며 아이가 하는 행동의 의미를 이해하고자 적극적으로 노력하는 모습이 관찰되었어요. 그러다 보니 아이가 필요로 하거나 기대하는 반응을 잘 해줄 수 있어서 아이의 놀이도 자연스럽게 잘 이어질 수 있었답니다. 아이의 흥미와 관심을 아는 엄마의 민감함은 아이와의 애착관계에도 도움이 될 뿐만 아니라 아이의 발달을 촉진하는데도 매우 중요한 역할을 하는 강점이에요",
      "아이의 행동이나 말에 대해 즉각적으로, 적절하게 반응해주는 모습이 자주 관찰되었어요.  앞서서 다른 이야기를 하거나 부모의 의도가 담긴 질문을 던지기 보다는 지금 아이가 하고 있는 행동이나 이야기에 대한 즉각적인 반응(REACTION) 이었어요. 이러한 엄마의 반응하기는 아이로 하여금 엄마가 자신에게 집중해주며 관심을 주고 있다는 안정감을 주며, 의미있는 행동을 반복할 수 있도록 도와주기에 인지 및 정서발달에 매우 긍정적인 영향을 준답니다!",
      "아이와의 놀이 내내 엄마 역시 자연스럽고 신나는 모습을 보여주었어요. 이러한 엄마의 즐거움은, 놀이 그 자체에 대한 즐거움 일 수도 있고, 아이와 함께 보내는 시간에 대한 즐거움 일 수도 있어요.  엄마가 즐거운 감정을 느낀 다는 것은 같은 시간내에서 그 즐거움이 아이에게 공유된다는 의미이기도 해요. 엄마의 즐거움은 전체적으로 아이의 놀이도 즐겁게 만들고 편안한 분위기를 지속되게 하는 좋은 자원이랍니다.",
      "아이가 놀이의 주인이 되도록 하는 바람직한 상호작용 방식을 가지고 계세요.놀이를 통해 아이에게 지식을 가르친다거나 부모의 놀이방식에  아이를 따르게 하는 모습과는 거리가 멀지요. 아이에게 놀이의 주도권을 주는 엄마의 강점을 통해 아이는 놀이에서 자신의 심리적 스트레스를 해소하고 사회성에 필요한 기술을 마음껏 연습해볼 수 있기에 정서발달 및 사회성 발달에 도움이 된다고 볼 수 있어요.",
      "아이에게 따뜻하고 애정어린 목소리로 격려하고 애정을 표현하거나, 아이가 목표를 성취해 냈을 때 머리를 쓰다듬어주는 신체적 접촉 등을 하는 모습을 자주 관찰 할 수 있었어요. 모든 부모가 아이에게 따뜻하게 대할 것 같지만 대다수의 부모님들이 아이에게 직접적인 말과 행동으로 표현하지 못하신답니다. 그러한 측면에서 엄마의 따뜻함은 아이에게 심리적 안정감을 주고 좀 더 나아가며 도전하게 만드는 아주 중요한 자원이 될 수 있어요. ",
    ],
  ),
  GuideMent(title: "부모 보완점", content: [
    "놀이장면 내내 아이와 되도록 마주보고 눈을 맞추며 아이가 하는 행동의 의미를 이해하고자 적극적으로 노력하는 모습이 관찰되었어요. 그러다 보니 아이가 필요로 하거나 기대하는 반응을 잘 해줄 수 있어서 아이의 놀이도 자연스럽게 잘 이어질 수 있었답니다. 아이의 흥미와 관심을 아는 엄마의 민감함은 아이와의 애착관계에도 도움이 될 뿐만 아니라 아이의 발달을 촉진하는데도 매우 중요한 역할을 하는 강점이에요.",
    "아이에게 따뜻하고 애정어린 목소리로 격려하고 애정을 표현하거나, 아이가 목표를 성취해 냈을 때 머리를 쓰다듬어주는 신체적 접촉 등을 하는 모습을 자주 관찰 할 수 있었어요. 모든 부모가 아이에게 따뜻하게 대할 것 같지만 대다수의 부모님들이 아이에게 직접적인 말과 행동으로 표현하지 못하신답니다. 그러한 측면에서 엄마의 따뜻함은 아이에게 심리적 안정감을 주고 좀 더 나아가며 도전하게 만드는 아주 중요한 자원이 될 수 있어요. ",
    "아이가 놀이의 주인이 되도록 하는 바람직한 상호작용 방식을 가지고 계세요.놀이를 통해 아이에게 지식을 가르친다거나 부모의 놀이방식에  아이를 따르게 하는 모습과는 거리가 멀지요. 아이에게 놀이의 주도권을 주는 엄마의 강점을 통해 아이는 놀이에서 자신의 심리적 스트레스를 해소하고 사회성에 필요한 기술을 마음껏 연습해볼 수 있기에 정서발달 및 사회성 발달에 도움이 된다고 볼 수 있어요.",
    "아이의 행동이나 말에 대해 즉각적으로, 적절하게 반응해주는 모습이 자주 관찰되었어요.  앞서서 다른 이야기를 하거나 부모의 의도가 담긴 질문을 던지기 보다는 지금 아이가 하고 있는 행동이나 이야기에 대한 즉각적인 반응(REACTION) 이었어요. 이러한 엄마의 반응하기는 아이로 하여금 엄마가 자신에게 집중해주며 관심을 주고 있다는 안정감을 주며, 의미있는 행동을 반복할 수 있도록 도와주기에 인지 및 정서발달에 매우 긍정적인 영향을 준답니다!",
    "아이와의 놀이 내내 엄마 역시 자연스럽고 신나는 모습을 보여주었어요. 이러한 엄마의 즐거움은, 놀이 그 자체에 대한 즐거움 일 수도 있고, 아이와 함께 보내는 시간에 대한 즐거움 일 수도 있어요.  엄마가 즐거운 감정을 느낀 다는 것은 같은 시간내에서 그 즐거움이 아이에게 공유된다는 의미이기도 해요. 엄마의 즐거움은 전체적으로 아이의 놀이도 즐겁게 만들고 편안한 분위기를 지속되게 하는 좋은 자원이랍니다."
  ]),
];
